---
type: ContourSettingItem
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ContourSettingItem

`Autodesk.Revit.DB.ContourSettingItem` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Start | 2024 | `public double Start { get ; }` |
| Property | Step | 2024 | `public double Step { get ; }` |
| Property | Stop | 2024 | `public double Stop { get ; }` |
| Property | SubCategoryId | 2024 | `public ElementId SubCategoryId { get ; }` |